// Задача 1. Разработайте функцию, которая принимает целое число в качестве аргумента и возвращает строку, содержащую это число и слово "компьютер" в нужном склонении по падежам в зависимости от числа. 
// Например, при вводе числа 25 функция должна возвращать "25 компьютеров", для числа 41 — "41 компьютер", а для числа 1048 — "1048 компьютеров".

function task1(number = 0) {

    let lastNumber = number % 10
    let lastTwoNumbers = number % 100

    let result = number + ' '

    if (lastTwoNumbers > 10 && lastTwoNumbers < 20) {
        result += 'компьютеров'
    } else if (lastNumber === 1) {
        result += 'компьютер'
    } else if (lastNumber > 1 && lastNumber < 5) {
        result += 'компьютера'
    } else {
        result += 'компьютеров'
    }

    return result
}

/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

// Задача 2. Написать функцию/метод, которая на вход получает массив положительных целых чисел произвольной длины. 
// Например [42, 12, 18]. На выходе возвращает массив чисел, которые являются общими делителями для всех указанных числе. В примере это будет [2, 3, 6].

function task2(arr = [42, 12, 18]) {
    let maxNOD = arr.reduce((acc, next) => {
        let a = acc
        let b = next

        while (b !== 0) {
            let item = b
            b = a % b
            a = item
        }

        return a
    })

    let result = []

    for (let i = 2; i <= maxNOD; i++) {
        if (maxNOD % i === 0) {
            result.push(i)
        }
    }

    return result
}

/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////


// Задача 3. Написать функцию/метод, которая возвращает массив простых чисел в диапазоне (2 числа - минимальное и максимальное) заданных чисел.
// Например, на вход переданы 2 числа: от 11 до 20  (диапазон считается включая граничные значения).
// На выходе программа должна выдать [11, 13 , 17, 19]


function task3(min = 11, max = 20) {
    let result = []

    let isPrime = (num = 0) => {
        for (let i = 2; i < Math.sqrt(num); i++) {
            if (num % i === 0) {
                return false
            }
        }
        return true
    }

    for (let i = min; i <= max; i++) {

        if (isPrime(i)) {
            result.push(i)
        }
    }

    return result
}

/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

// Задача 4. Написать метод, который в консоль выводит таблицу умножения. 
// На вход метод получает число, до которого выводит таблицу умножения. 
// В консоли должна появиться таблица. Например, если на вход пришло число 5, то получим:


function task4(num = 5) {

    let maxLength = (num ** 2) + ''
    maxLength = maxLength.length + 1

    for (let i = 1; i <= num; i++) {

        let line = ''

        for (let j = 1; j <= num; j++) {

            line += `${i * j}`.padStart(maxLength, ' ')

        }
        console.log(line)
    }

}

/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
